## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.sre-bot will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "sre-bot"  {
      ~ id       = "f1d8466984c017e4b65a39cd9c1b02a55385b0b8d2e052a0516036f21ea3f9b0" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "SRE_DRIVE_ID"
                          - value = "0AIDSjTWDkyPxUk9PVA"
                        },
                      - {
                          - name  = "SRE_INCIDENT_FOLDER"
                          - value = "13CqZaprwAqebkrcFnOdwkAt3JT4Fs2It"
                        },
                      - {
                          - name  = "INCIDENT_TEMPLATE"
                          - value = "1Nb9Zh0OR2HulVtpqDpFnRTcq6VwsWSaKK9QS3Y6o0TE"
                        },
                      - {
                          - name  = "INCIDENT_LIST"
                          - value = "16LyYJNzy4ccoTAXSLuNf53iI6nE1a94WlXkSI8rIgOg"
                        },
                      - {
                          - name  = "INCIDENT_CHANNEL"
                          - value = "CUYR73ESX"
                        },
                    ]
                  - image            = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/sre-bot:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/sre-bot-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-sre-bot"
                        }
                    }
                  - name             = "sre-bot"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SLACK_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH"
                        },
                      - {
                          - name      = "APP_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH"
                        },
                      - {
                          - name      = "PICKLE_STRING"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = <<-EOT
            [
              {
                "environment": [
                  {
                    "name": "SRE_DRIVE_ID",
                    "value": "${sre_drive_id}"
                  },
                  {
                    "name": "SRE_INCIDENT_FOLDER",
                    "value": "${sre_incident_folder}"
                  },
                  {
                    "name": "INCIDENT_TEMPLATE",
                    "value": "${incident_template}"
                  },
                  {
                    "name": "INCIDENT_LIST",
                    "value": "${incident_list}"
                  },
                  {
                    "name": "INCIDENT_CHANNEL",
                    "value": "${incident_channel}"
                  }
                ],
                "image": "${image}",
                "linuxParameters": {
                  "capabilities": {
                    "drop": [
                      "ALL"
                    ]
                  }
                },
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${awslogs-group}",
                    "awslogs-region": "${awslogs-region}",
                    "awslogs-stream-prefix": "${awslogs-stream-prefix}"
                  }
                },
                "name": "sre-bot",
                "portMappings": [
                  {
                    "containerPort": 8000
                  }
                ],
                "secrets": [
                  {
                    "name": "SLACK_TOKEN",
                    "valueFrom": "${slack_token}"
                  },
                  {
                    "name": "APP_TOKEN",
                    "valueFrom": "${app_token}"
                  },
                  {
          +         "name": "OPSGENIE_KEY",
          +         "valueFrom": "${opsgenie_key}"
          +       }
          +       {
                    "name": "PICKLE_STRING",
                    "valueFrom": "${pickle_string}"
                  }
                ],
                "ulimits": [
                  {
                    "hardLimit": 1000000,
                    "name": "nofile",
                    "softLimit": 1000000
                  }
                ]
              }
            ]
        EOT
      ~ vars     = {
          + "opsgenie_key"          = (known after apply)
            # (15 unchanged elements hidden)
        }
    }

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:283582579564:service/sre-bot-cluster/sre-bot-service"
        name                               = "sre-bot-service"
        tags                               = {
            "CostCentre" = "sre-bot"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:5" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sre-bot must be replaced
-/+ resource "aws_ecs_task_definition" "sre-bot" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "INCIDENT_CHANNEL"
                          - value = "CUYR73ESX"
                        },
                      - {
                          - name  = "INCIDENT_LIST"
                          - value = "16LyYJNzy4ccoTAXSLuNf53iI6nE1a94WlXkSI8rIgOg"
                        },
                      - {
                          - name  = "INCIDENT_TEMPLATE"
                          - value = "1Nb9Zh0OR2HulVtpqDpFnRTcq6VwsWSaKK9QS3Y6o0TE"
                        },
                      - {
                          - name  = "SRE_DRIVE_ID"
                          - value = "0AIDSjTWDkyPxUk9PVA"
                        },
                      - {
                          - name  = "SRE_INCIDENT_FOLDER"
                          - value = "13CqZaprwAqebkrcFnOdwkAt3JT4Fs2It"
                        },
                    ]
                  - essential        = true
                  - image            = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/sre-bot:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/sre-bot-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-sre-bot"
                        }
                    }
                  - mountPoints      = []
                  - name             = "sre-bot"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SLACK_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH"
                        },
                      - {
                          - name      = "APP_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH"
                        },
                      - {
                          - name      = "PICKLE_STRING"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "sre-bot-task" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.opsgenie_key will be created
  + resource "aws_secretsmanager_secret" "opsgenie_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "opsgenie-key-144676"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.opsgenie_key will be created
  + resource "aws_secretsmanager_secret_version" "opsgenie_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.sre_bot_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.sre_bot_healthcheck"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.opsgenie_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.pickle_string"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.slack_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.sre_bot_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

37 tests, 16 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
